{
  "intents": [
    {
      "keywords": ["hello", "hi", "hey", "greetings", "good morning", "good afternoon", "good evening"],
      "responses": {
        "en": "Hello! I'm here to help you. How can I assist you today?",
        "ml": "ഹലോ! ഞാൻ നിങ്ങളെ സഹായിക്കാൻ ഇവിടെയുണ്ട്. ഇന്ന് ഞാൻ നിങ്ങളെ എങ്ങനെ സഹായിക്കാം?"
      }
    },
    {
      "keywords": ["help", "support", "assist", "aid", "guide"],
      "responses": {
        "en": "Of course! I'm here to help. Please tell me what you need assistance with, and I'll do my best to guide you.",
        "ml": "തീർച്ചയായും! ഞാൻ സഹായിക്കാൻ ഇവിടെയുണ്ട്. ദയവായി നിങ്ങൾക്ക് എന്ത് സഹായം വേണമെന്ന് എന്നോട് പറയുക, ഞാൻ നിങ്ങളെ നയിക്കാൻ എന്റെ മികച്ച ശ്രമം നടത്തും."
      }
    },
    {
      "keywords": ["weather", "temperature", "rain", "sunny", "cold", "hot"],
      "responses": {
        "en": "I understand you're asking about the weather. For the most accurate and current weather information, I recommend checking your local weather service or weather app. Is there anything else I can help you with?",
        "ml": "നിങ്ങൾ കാലാവസ്ഥയെക്കുറിച്ച് ചോദിക്കുന്നുവെന്ന് ഞാൻ മനസ്സിലാക്കുന്നു. ഏറ്റവും കൃത്യവും നിലവിലെ കാലാവസ്ഥാ വിവരങ്ങൾക്കായി, നിങ്ങളുടെ പ്രാദേശിക കാലാവസ്ഥാ സേവനം അല്ലെങ്കിൽ കാലാവസ്ഥാ ആപ്പ് പരിശോധിക്കാൻ ഞാൻ ശുപാർശ ചെയ്യുന്നു. മറ്റെന്തെങ്കിലും എനിക്ക് നിങ്ങളെ സഹായിക്കാൻ കഴിയുമോ?"
      }
    },
    {
      "keywords": ["time", "clock", "what time", "hour", "when"],
      "responses": {
        "en": "To check the current time, please look at the clock on your device or ask your device's voice assistant. I'm here to help with other questions though!",
        "ml": "നിലവിലെ സമയം പരിശോധിക്കാൻ, ദയവായി നിങ്ങളുടെ ഉപകരണത്തിലെ ക്ലോക്ക് നോക്കുക അല്ലെങ്കിൽ നിങ്ങളുടെ ഉപകരണത്തിന്റെ വോയ്‌സ് അസിസ്റ്റന്റിനോട് ചോദിക്കുക. എന്നിരുന്നാലും മറ്റ് ചോദ്യങ്ങൾക്ക് സഹായിക്കാൻ ഞാൻ ഇവിടെയുണ്ട്!"
      }
    },
    {
      "keywords": ["thank", "thanks", "appreciate", "grateful"],
      "responses": {
        "en": "You're very welcome! I'm glad I could help. Feel free to ask me anything else anytime.",
        "ml": "നിങ്ങൾക്ക് വളരെ സ്വാഗതം! എനിക്ക് സഹായിക്കാൻ കഴിഞ്ഞതിൽ ഞാൻ സന്തോഷിക്കുന്നു. എപ്പോൾ വേണമെങ്കിലും മറ്റെന്തെങ്കിലും എന്നോട് ചോദിക്കാൻ മടിക്കേണ്ട."
      }
    },
    {
      "keywords": ["goodbye", "bye", "see you", "farewell", "exit", "leave"],
      "responses": {
        "en": "Goodbye! Take care and remember, I'm always here if you need help again. Have a wonderful day!",
        "ml": "വിട! ശ്രദ്ധിക്കുക, നിങ്ങൾക്ക് വീണ്ടും സഹായം വേണമെങ്കിൽ ഞാൻ എപ്പോഴും ഇവിടെയുണ്ട് എന്ന് ഓർക്കുക. ഒരു മനോഹരമായ ദിവസം!"
      }
    },
    {
      "keywords": ["health", "doctor", "medical", "medicine", "pain", "illness", "sick"],
      "responses": {
        "en": "For health-related questions, it's important to consult with a healthcare professional or doctor. I can provide general information, but always check with medical experts for personal health concerns. Would you like help finding a doctor or medical service?",
        "ml": "ആരോഗ്യവുമായി ബന്ധപ്പെട്ട ചോദ്യങ്ങൾക്ക്, ഒരു ആരോഗ്യ പ്രൊഫഷണലോ ഡോക്ടറോടോ കൂടിയാലോചിക്കേണ്ടത് പ്രധാനമാണ്. എനിക്ക് പൊതുവായ വിവരങ്ങൾ നൽകാം, പക്ഷേ വ്യക്തിഗത ആരോഗ്യ ആശങ്കകൾക്ക് എപ്പോഴും മെഡിക്കൽ വിദഗ്ധരുമായി പരിശോധിക്കുക. ഒരു ഡോക്ടറെയോ മെഡിക്കൽ സേവനത്തെയോ കണ്ടെത്തുന്നതിൽ സഹായം വേണമോ?"
      }
    },
    {
      "keywords": ["technology", "computer", "phone", "internet", "website", "app"],
      "responses": {
        "en": "Technology can sometimes feel overwhelming, but don't worry - we can take it one step at a time. Could you tell me more specifically what you'd like help with? I'm here to guide you through it gently.",
        "ml": "സാങ്കേതികവിദ്യ ചിലപ്പോൾ അമിതമായി തോന്നിയേക്കാം, പക്ഷേ വിഷമിക്കേണ്ട - നമുക്ക് ഓരോ ഘട്ടമായി എടുക്കാം. നിങ്ങൾക്ക് സഹായം വേണ്ട എന്താണെന്ന് കൂടുതൽ വ്യക്തമായി പറയാമോ? അതിലൂടെ നിങ്ങളെ സൗമ്യമായി നയിക്കാൻ ഞാൻ ഇവിടെയുണ്ട്."
      }
    },
    {
      "keywords": ["how are you", "how are you doing", "how do you do"],
      "responses": {
        "en": "I'm doing well, thank you for asking! I'm here and ready to help you with whatever you need. How can I assist you today?",
        "ml": "എനിക്ക് നന്നായിരിക്കുന്നു, ചോദിച്ചതിന് നന്ദി! നിങ്ങൾക്ക് വേണ്ടതെന്തും സഹായിക്കാൻ ഞാൻ ഇവിടെയുണ്ട്, തയ്യാറാണ്. ഇന്ന് ഞാൻ നിങ്ങളെ എങ്ങനെ സഹായിക്കാം?"
      }
    },
    {
      "keywords": ["name", "who are you", "what are you", "identity"],
      "responses": {
        "en": "I'm your friendly chatbot assistant! I'm here to help answer your questions and provide support. You can think of me as a helpful friend who's always ready to chat. What would you like to know more about?",
        "ml": "ഞാൻ നിങ്ങളുടെ സൗഹൃദപരമായ ചാറ്റ്‌ബോട്ട് അസിസ്റ്റന്റാണ്! നിങ്ങളുടെ ചോദ്യങ്ങൾക്ക് ഉത്തരം നൽകാനും പിന്തുണ നൽകാനും ഞാൻ ഇവിടെയുണ്ട്. എപ്പോഴും സംസാരിക്കാൻ തയ്യാറായിരിക്കുന്ന ഒരു സഹായക സുഹൃത്തായി നിങ്ങൾക്ക് എന്നെ കരുതാം. നിങ്ങൾ കൂടുതൽ അറിയാൻ ആഗ്രഹിക്കുന്നത് എന്താണ്?"
      }
    }
  ],
  "defaultResponse": {
    "en": "I'm not entirely sure how to help with that, but I'm here and ready to listen. Could you rephrase your question, or would you like to try asking something else? I'm happy to help in any way I can!",
    "ml": "അതിൽ എങ്ങനെ സഹായിക്കണമെന്ന് എനിക്ക് പൂർണ്ണമായി ഉറപ്പില്ല, പക്ഷേ ഞാൻ ഇവിടെയുണ്ട്, കേൾക്കാൻ തയ്യാറാണ്. നിങ്ങളുടെ ചോദ്യം പുനർഘടന ചെയ്യാമോ, അല്ലെങ്കിൽ മറ്റെന്തെങ്കിലും ചോദിക്കാൻ ശ്രമിക്കാമോ? എനിക്ക് കഴിയുന്ന ഏത് രീതിയിലും സഹായിക്കാൻ സന്തോഷമുണ്ട്!"
  },
  "greeting": {
    "en": "Welcome! 👋 I'm your friendly chatbot assistant. Feel free to ask me anything - I'm here to help make things easier for you. How can I assist you today?",
    "ml": "സ്വാഗതം! 👋 ഞാൻ നിങ്ങളുടെ സൗഹൃദപരമായ ചാറ്റ്‌ബോട്ട് അസിസ്റ്റന്റാണ്. എന്തും ചോദിക്കാൻ മടിക്കേണ്ട - കാര്യങ്ങൾ നിങ്ങൾക്ക് എളുപ്പമാക്കാൻ സഹായിക്കാൻ ഞാൻ ഇവിടെയുണ്ട്. ഇന്ന് ഞാൻ നിങ്ങളെ എങ്ങനെ സഹായിക്കാം?"
  }
}
